app/controllers/matches_controller.rb

  def index
    @matches = Match.all
---
SELECT * FROM "matches"

  def show
    @match = Match.find(params[:id])
---
SELECT * FROM "matches" WHERE ("matches"."id" = 1)

  def edit
    @match = Match.find(params[:id])
---
SELECT * FROM "matches" WHERE ("matches"."id" = 1)

  def create
    @match = Match.new(params[:match])
    respond_to do |format|
      if @match.save
---
INSERT INTO "matches" ("name", "created_at", "updated_at", "datematch", "winning_team_id", "group_id") VALUES(NULL, '2010-04-13 23:56:04.556914', '2010-04-13 23:56:04.556914', NULL, NULL, NULL) RETURNING "id"

  def destroy
    @match = Match.find(params[:id])
    @match.destroy
---
SELECT * FROM "matches" WHERE ("matches"."id" = 1)
DELETE FROM "matches" WHERE "id" = 1